In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, f1_score, mean_squared_error

In [6]:
df = sns.load_dataset('titanic')
df.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [7]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
df['age'].fillna(df['age'].mean(), inplace=True)
df['embarked'].fillna(df['embarked'].mode()[0], inplace=True)

df.drop(columns=['embark_town', 'deck', 'alive', 'alone'], inplace=True)

In [13]:
encoder = LabelEncoder()
df_cat = df.select_dtypes(exclude=np.number)

for col in df_cat.columns:
    df_cat[col] = encoder.fit_transform(df_cat[col])
df[df_cat.columns] = df_cat

In [14]:
train, test = train_test_split(df, random_state=42)

train_y = train['survived']
train_x = train.copy()
train_x.drop(columns=['survived'], inplace=True)

valid_y = test['survived']
valid_x = test.copy()
valid_x.drop(columns=['survived'], inplace=True)

In [15]:
model = RandomForestClassifier()
model.fit(train_x, train_y)
pred = model.predict(valid_x)

print("정확도 : ", accuracy_score(pred, valid_y))

정확도 :  0.8251121076233184

# 3회차

## 1유형

In [25]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv')
df.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [27]:
# 결측치가 하나라도 존재하는 행의 경우 경우 해당 행을 삭제하라. 
# 그후 남은 데이터의 상위 70%에 해당하는 데이터만 남겨둔 후 median_income 컬럼의 1분위수를 반올림하여 소숫점이하 2째자리까지 구하여라
df = df.dropna().reset_index(drop=True)
df_filter = df.iloc[:int(len(df)*0.7)]
ans = round(df_filter['median_income'].quantile(1/4),2)
print(ans)

2.51

In [28]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv')
df.head()

  Country Name Country Code  Year      Value
0   Arab World          ARB  1968  2576068.3
1   Arab World          ARB  1969  2843420.4
2   Arab World          ARB  1970  3138550.0
3   Arab World          ARB  1971  3642691.0
4   Arab World          ARB  1972  4331605.7

In [34]:
# 1990년도는 해당년도 평균 이하 GDP를 가지지만, 2010년도에는 해당년도 평균 이상 GDP를 가지는 국가의 숫자를 구하여라
mean_1990 = df[df['Year'] == 1990]['Value'].mean()
mean_2010 = df[df['Year'] == 2010]['Value'].mean()

countries_1990 = df[(df['Year'] == 1990) & (df['Value'] <= mean_1990)]['Country Name']
countries_2010 = df[(df['Year'] == 2010) & (df['Value'] >= mean_2010)]['Country Name']

ans = set(countries_1990).intersection(set(countries_2010))
ans = len(ans)
print(ans)

5

In [38]:
mean_1990 = df[df['Year']==1990]['Value'].mean()
mean_2010 = df[df['Year']==2010]['Value'].mean()
count_1990 = df[(df['Year'] ==1990) & (df['Value']<= mean_1990)]['Country Name']
count_1990.to_list()
count_2010 = df[(df['Year'] ==2010) & (df['Value']>= mean_2010)]['Country Name']
count_2010.to_list()

ans = list(set(count_1990) & set(count_2010))
print(len(ans))

5

In [39]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,C123,S

In [43]:
# 데이터에서 결측치가 가장 많은 컬럼을 출력하라
ans = df.isnull().sum().sort_values().index[-1]
print(ans)

Fare

## 3유형

In [92]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_1.csv')
df.head()

       ID     투약전     투약후
0  user_1  55.137  56.106
1  user_2  66.584  60.409
2  user_3  52.259  50.639
3  user_4  77.081  69.164
4  user_5  62.677  57.622

In [ ]:
# 투약 후 체중에서 투약 전 체중을 뺏을 때 값은 일반 적으로 세가지 등급으로 나눈다. 
# -3이하 : A등급, -3초과 0이하 : B등급, 0 초과 : C등급. 
# 약 실험에서 A,B,C 그룹간의 인원 수 비율은 2:1:1로 알려져 있다. 
# 위 데이터 표본은 각 범주의 비율에 적합한지 카이제곱 검정하려한다.

In [93]:
# A등급에 해당하는 유저는 몇명인지 확인하라
df['dels'] = df['투약후'] - df['투약전']

def groupby_filter(x):
    if x <=-3:
        return 'A'
    
    elif x <=0:
        return 'B'
    
    else:
        return 'C'
    
df['groupby'] = df['dels'].apply(groupby_filter)
result = df['groupby'].value_counts().sort_index()['A']
print(result)

121

In [83]:
from scipy.stats import chi2_contingency
def check(row):
    if ((row['투약후'] - row['투약전']) <= -3):
        return 'A'
    elif ((row['투약후'] - row['투약전']) > 0):
        return 'C'
    else:
        return 'B'

# 데이터프레임에 group 컬럼 추가
df['group'] = df.apply(check, axis=1)

# 그룹별 빈도표 생성
group_counts = df['group'].value_counts().sort_index()

# 기대 빈도 계산 (2:1:1 비율)
total = group_counts.sum()
expected_counts = [total * 2 / 4, total * 1 / 4, total * 1 / 4]

# 관측값과 기대값을 사용하여 카이제곱 검정 수행
observed = group_counts.values
chi2, p, dof, expected = chi2_contingency([observed, expected_counts])

# 카이제곱 통계량을 소수점 이하 3째자리까지 반올림하여 출력
chi2_rounded = round(chi2, 3)
print(chi2_rounded)

1.898

In [86]:
# 카이제곱 검정 p값을 반올림하여 소숫점 이하 3자리까지 구하고, 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 가설을 하나를 선택하시오(귀무/대립)
print(round(p,3))
print("귀무")

0.387
귀무

In [95]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_2_.csv')
df.head()

     rpm group
0  163.6     A
1  246.9     A
2  234.9     A
3  156.9     A
4  226.6     A

In [98]:
# A,B 공장 각각 정규성을 가지는지 샤피로 검정을 통해 확인하라. (각 공장의 pvalue 출력할 것)
from scipy.stats import shapiro
a = df[df['group']=='A'].rpm
b =  df[df['group']=='B'].rpm
print(shapiro(a))
print(shapiro(b))

ShapiroResult(statistic=0.9863898158073425, pvalue=0.397915244102478)
ShapiroResult(statistic=0.9943947196006775, pvalue=0.9562925100326538)

In [100]:
# A,B 공장 생산 제품의 rpm은 각각 정규성을 가지는지 샤피로 검정을 통해 확인하라. (각 공장의 pvalue 출력할 것)
from scipy.stats import levene
s , p =levene(a,b)
round_p = round(p,3)
print(round_p)

0.904

In [101]:
# 대응 표본 t 검정을 통해 B공장 제품들의 rpm이 A 공장 제품의 rpm보다 크다고 말할 수 있는지 검정하라. 
# pvalue를 소숫점 이하 3자리까지 출력하고 귀무가설, 대립가설 중 하나를 출력하라
from scipy.stats import ttest_rel
s , p =ttest_rel(b,a,alternative='greater')
round_p = round(p,3)
print(round_p)
print('대립')

0.009
대립

# 2회차

## 1유형

In [133]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p1_1.csv')
df.head(2)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,NaN,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.9,4.98,24.0
1,0.02731,NaN,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.9,9.14,21.6

In [134]:
# 주어진 Dataset에서 CRIM값이 가장 큰 10개의 지역을 구하고
# 10개의 지역의 CRIM값을 그 중 가장 작은 값으로 대체하라. 그리고
# AGE 컬럼 값이 80이상인 대체 된 CRIM 평균값을 구하라

sub = df.sort_values(['CRIM']).index[-10:]
min = df.loc[sub,'CRIM'].min()
df.loc[sub, 'CRIM'] = min

ans = df[df['AGE']>=80]['CRIM'].mean()
print(ans)

5.759386625

In [136]:
# 1-1에서 사용한 데이터에서 RM 중앙값으로 해당 컬럼의 결측치를 대체하라
# 그리고 해당 컬럼의 결측치 대치 전후의 표준편차 차이의 절댓값을 소숫점 이하 3째자리 까지 구하라
before_std = np.std(df['RM'])
df['RM'].fillna(df['RM'].median(),inplace=True)
after_std = np.std(df['RM'])
print(before_std, after_std)

0.7204819219454744 0.6932046181190024

In [137]:
print(round(abs(before_std-after_std),3))

0.027

In [138]:
# 주어진 Dataset의 DIS 평균으로 부터 1.5 * 표준편차를 벗어나는 영역을 이상치라고 판단하고
# DIS 컬럼의 이상치들의 합을 구하여라.
mean = df['DIS'].mean()
std = np.std(df['DIS'])

ans = df[(df['DIS']<mean-1.5*std) | (df['DIS']>mean+1.5*std)]['DIS'].sum()
print(ans)

404.4101

## 3유형

In [139]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p3_1.csv')
df.head(5)

     fish   height
0  fish_1  33.74cm
1  fish_2  31.64cm
2  fish_3  27.49cm
3  fish_4  31.43cm
4  fish_5  27.56cm

In [141]:
# 122마리의 height 평균값을 m(미터) 단위로 소숫점 이하 5자리까지 실수 값만 출력하라
df['height'] = df['height'].str.extract('(\d+\.\d+)').astype(float) 
df['height'] = df['height'] / 100
ans = df['height'].mean()
print(round(ans,5))

0.29951

In [144]:
# 모집단의 평균 길이가 30cm 인지 확인하려 일표본 t 검정을 시행하여 확인하려한다. 
# 검정통계량을 소숫점 이하 3째자리까지 구하여라


from scipy.stats import ttest_1samp
s, p = ttest_1samp(df['height']*100, 30)
print(round(s,3))

-0.217

In [146]:
# 위의 통계량에 대한 p-값을 구하고 (반올림하여 소숫점 이하 3째자리), 
# 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 가설을 하나를 선택하시오(귀무/대립)
print(round(p,3))
print('귀무')

0.829
귀무

In [ ]:
# 조사결과 70%의 성인 남성이 3년 동안에 적어도 1번 치과를 찾는다고 할때, 
# 21명의 성인 남성이 임의로 추출되었다고 하자.

In [147]:
# 21명 중 16명 미만이 치과를 찾았을 확률(반올림하여 소숫점 이하 3자리)
n = 21
p = 0.7
k = 16

from scipy.stats import binom
prob = binom.cdf(k-1, n, p)
print(round(prob, 3))

0.637

In [148]:
# 적어도 19명이 치과를 찾았을 확률(반올림하여 소숫점 이하 3자리)
n = 21
p = 0.7
k = 19

# P(X >= k) 계산
prob = 1 - binom.cdf(k-1, n, p)
print(round(prob, 3))

0.027